*** Window

#+BEGIN_SRC emacs-lisp
    (add-to-list 'default-frame-alist '(fullscreen . maximized))
    menu-bar-mode -1
    tool-bar-mode -1
    scroll-bar-mode -1
    current-language-environment "UTF-8"
    custom-enabled-themes '(misterioso)
    global-display-line-numbers-mode t
    fringe-mode '(16 . 0)
    window-divider-mode t
    window-divider-default-places 'right-only
    window-divider-default-right-width 1
    font-lock-maximum-decoration t

    (set-face-attribute 'header-line nil
                        :background "#2e3748"
                        :foreground "gray"
                        :height 96)
  
    (setq header-line-height 32)


#+END_SRC

#+RESULTS:
: 32

#+BEGIN_SRC emacs-lisp
  (add-hook 'server-after-make-frame-hook (lambda() (scroll-bar-mode -1)))
#+END_SRC

*** Powerline
#+BEGIN_SRC emacs-lisp
  (use-package powerline
    :ensure t
    :config
    (powerline-default-theme))

#+END_SRC

Also some appearance declaraitions for modeline

#+BEGIN_SRC emacs-lisp
  (set-face-attribute 'mode-line nil
                      :background "#e67128"
                      :foreground "white"
                      :box '(:line-width 2 :color "#233B3B")
                      :overline nil
                      :underline nil)

  (set-face-attribute 'mode-line-inactive nil
                      :background "#182b2b"
                      :foreground "DarkGrey"
                      :box '(:line-width 1 :color "#182b2b")
                      :overline nil
                      :underline nil)

  (set-face-attribute 'powerline-active1 nil
                      :background "#23d7d7"
                      :foreground "black"
                      :overline nil
                      :underline nil)


  (set-face-attribute 'powerline-active2 nil
                      :background "#008b8b"
                      :foreground "black"
                      :overline nil
                      :underline nil)

  (set-face-attribute 'powerline-inactive2 nil
                      :background "#182b2b"
                      :foreground "white"
                      :overline nil
                      :underline nil)
#+END_SRC

#+BEGIN_SRC emacs-lisp
  column-number-mode t
  mode-line-compact nil
  (setq powerline-default-separator 'slant)
  (setq powerline-height 38)
#+END_SRC

#+RESULTS:
: 38

